'''
Исполнитель А22 преобразует целое число, записанное на экране.
У исполнителя три команды, каждой команде присвоен номер.
1. Прибавь 1.
2. Прибавь 3.
3. Прибавь предыдущее.
Первая команда увеличивает число на экране на 1, вторая увеличивает 
это число на 3, третья прибавляет к числу на экране число, меньшее на 1 
(к числу 3 прибавляется 2, к числу 11 прибавляется 10 и так далее).
 Программа для исполнителя А22 — это последовательность команд.
Сколько существует программ, которые число 2 преобразуют в число 10?
'''

print(57 // 10)
print((-57) // 10)

print(57 % 10)
print((-57) % 10)
# ....-60 <- -57...0...50 <- 57.....
