'''
Алгоритм вычисления значения функции F(n), где n — натуральное число, задан следующими соотношениями:
F(n) = n, при n < 11;
F(n) = n + F(n - 1), если n ≥ 11.

Чему равно значение выражения F(2024) - F(2021)?
'''

import sys
sys.setrecursionlimit(2500)

def f(n):
    if n < 11:
        return n
    return n + f(n - 1)

print(f(2024) - f(2021))
print(2024 + 2023 + 2022)
# f(2024) = 2024 + f(2023) = 2024 + 2023 + f(2022) = 2024 + 2023 + 2022 + f(2021)
# f(2024) - f(2021)= 2024 + f(2023) - f(2021) = 2024 + 2023 + f(2022) - f(2021) = 2024 + 2023 + 2022 + f(2021) - f(2021)=
# = 2024 + 2023 + 2022